#Dev : @iPiiii

HELP_1 = """↶**<u>- اوامر المشرفين:</u>**

اوامر المشرفين :
الامر : ‹ /pause › : ايقاف التشغيل في الاتصال مؤقتا
الامر : ‹ /resume › : استئناف التشغيل في الاتصال
الامر : ‹ /mute › : كتم صوت البوت
الامر : ‹ /unmute › : الغاء كتم صوت البوت
الامر : ‹ /skip › : تخطي التشغيل الحالي
الامر : ‹ /stop › : ايقاف التشغيل في الاتصال
الامر : ‹ /shuffle › : تغيير ترتيب قائمه الانتظار
الامر : ‹ /restart › : اعاده تشغيل البوت في مجموعنك

قائمه مشرفين البوت :
يمكن للاشخاص في هذه القائمه
التشغيل بدون الرفع مشرف في المجموعه
الامر : ‹ /auth معرف شخص › : رفع مشرف جديد في مجموعتك فقط
الامر : ‹ /unauth معرف شخص › : ازاله شخص من قائمه مشرفين البوت
الامر : ‹ /authusers › : عرض قائمه مشرفين البوت"""


HELP_2 = """↶<u>**اوامر التشغيل:**</u>
اوامر التشغيل :
الامر : ‹ /play - /vplay - /cplay › : بدء التشغيل في الاتصال 
الامر : ‹ /channelplay ايدي قناه › : ربط البوت في قناه محدده

قوائم تشغيل البوت :
الامر : ‹ /playlist › : عرض قائمه التشغيل في البوت
الامر : ‹ /deleteplaylist › : حذف تشغيل محدد من القائمه
الامر : ‹ /play › : التشغيل من قوائم التشغيل"""

HELP_3 = """↶<u>**اوامر البوت :**</u>

اوامر البوت :
الامر : ‹ /stats › : جلب احصائيات البوت
الامر : ‹ /sudolist › : عرض قائمه المطورين في البوت
الامر : ‹ /lyrics كلمات الاغنيه › : للبحث في الويب عنها
الامر : ‹ /song رابط - عنوان فيديو › : للتحميل من اليوتيوب"""
HELP_4 = """↶<u>**اوامر إضافية:**</u>

اوامر اضافيه :
الامر : ‹ /help › : عرض قائمه المساعده
الامر : ‹ /ping › : قياس بنك البوت

اعدادات المجموعات :
الامر : ‹ /settings › : عرض قائمه اعدادات مجموعتك"""

HELP_5 = """🔰**<u>إضافة وإزالة مطورين :</u>**

/addsudo [معرف المستخدم or الرد على مستخدم]
/delsudo [معرف المستخدم or الرد على مستخدم]

🛃**<u>هيروكو:</u>**
/usage - Dyno Usage.

🌐**<u>فارات التكوين:</u>**

/get_var - احصل على نسخة فار من Heroku أو .env.
/del_var - حذف أي var على Heroku أو .env.
/set_var [اسم فار] [القيمة] - تعيين Var أو تحديث Var على heroku أو .env. فصل Var وقيمته بمساحة.

🤖**<u> اوامر البوت:</u>**

/reboot - إعادة تشغيل الروبوت الخاص بك. 
/update - تحديث البوت.
/speedtest - التحقق من سرعات الخادم
/maintenance [تمكين / تعطيل] 
/logger [تمكين / تعطيل] - يقوم Bot بتسجيل الاستعلامات التي تم البحث عنها في مجموعة المسجل.
/get_log [Number of Lines] - احصل على سجل الروبوت الخاص بك من heroku أو VPS. يعمل لكليهما.

📈**<u>اوامر الإحصائيات:</u>**

/activevoice - تحقق من الدردشات الصوتية النشطة على الروبوت.
/activevideo - تحقق من مكالمات الفيديو النشطة على الروبوت.
/stats - تحقق من إحصائيات الروبوتات

⚠️**<u>القائمة السوداء وظيفة الدردشة:</u>**

/blacklistchat [معرف القناه] - القائمة السوداء لأي دردشة من استخدام Music Bot
/whitelistchat [معرف القناه] - القائمة البيضاء لأي دردشة مدرجة في القائمة السوداء من استخدام Music Bot
/blacklistedchat - التحقق من جميع الدردشات المدرجة في القائمة السوداء.

👤**<u>وظيفة محظورة:</u>**

/block [معرف المستخدم or الرد على مستخدم] - يمنع المستخدم من استخدام اوامــر الروبوت.
/unblock [معرف المستخدم or الرد على مستخدم] - إزالة مستخدم من القائمة المحظورة للبوت.
/blockedusers - التحقق من قوائم المستخدمين المحظورين

👤**<u>اوامــر العــام:</u>**

/gban [معرف المستخدم or الرد على مستخدم] - حظر مستخدم من الدردشة التي يخدمها الروبوت ومنعه من استخدام الروبوت الخاص بك.
/ungban [معرف المستخدم or الرد على مستخدم] - إزالة مستخدم من قائمة gban الخاصة ب Bot والسماح له باستخدام برنامج الروبوت الخاص بك
/gbannedusers - التحقق من قوائم المستخدمين المحظورين

🎥**<u>وظيفة مكالمات الفيديو:</u>**

/set_video_limit [عدد الدردشات] - تعيين الحد الأقصى لعدد الدردشات المسموح بها لمكالمات الفيديو في المرة الواحدة. افتراضي ل 3 دردشات.
/videomode [download|m3u8] - إذا تم تمكين وضع التنزيل ، فسيقوم Bot بتنزيل مقاطع الفيديو بدلا من تشغيلها في نموذج M3u8. ByDefault إلى M3u8. يمكنك استخدام وضع التنزيل عند عدم تشغيل أي استعلام في وضع m3u8.

⚡️**<u>وظيفة بوت خاصة:</u>**

/authorize [معرف القناه] - السماح بالدردشة لاستخدام الروبوت الخاص بك.
/unauthorize [معرف القناه] - عدم السماح للدردشة باستخدام الروبوت الخاص بك.
/authorized - تحقق من جميع الدردشات المسموح بها من الروبوت الخاص بك.

🌐**<u>وظيفة البث:</u>**

/broadcast [رسالة أو الرد على رسالة] - بث أي رسالة إلى الدردشات المعروضة في برنامج البوت.

<u>خيارات البث:</u>

**-pin** : سيؤدي ذلك إلى تثبيت رسالتك 
**-pinloud** : سيؤدي ذلك إلى تثبيت رسالتك بإشعار بصوت عال
**-user** : سيؤدي ذلك إلى بث رسالتك إلى المستخدمين الذين بدأوا تشغيل برنامج الروبوت الخاص بك
**-assistant** : سيؤدي الى بث رسالتك من الحساب المساعد
**-nobot** : سيؤدي ذلك إلى إجبار الروبوت الخاص بك على عدم بث الرسالة

**مثال:** `/broadcast -user -assistant -pin Hello Testing`



"""
